//DF01DATA JOB 'DF01DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF01DATA - RUN DF01DATA PROGRAM
//STEP1 EXEC PGM=DF01DATA
//DD1   DD   DSN=DF01FILE,DISP=OLD
/*
/&
