//DF01TEST JOB 'DF01TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF01TEST - RUN DF01TEST PROGRAM
//STEP1 EXEC PGM=DF01TEST
//DD1   DD   DSN=DF01FILE
/*
/&