//DF02TEST JOB 'DF02TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF02TEST - RUN DF02TEST PROGRAM 
//STEP1 EXEC PGM=DF02TEST
/*
/&
