//DF03AFTR JOB 'DF03TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF03TEST- RUN DF03TEST PROGRAM
//STEP1 EXEC PGM=DF03TEST
//DD1   DD   DSN=DF03FILE
/*
/&