//DF03DATA JOB 'DF03DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF03DATA - RUN DF03DATA PROGRAM
//STEP1 EXEC PGM=DF03DATA
//DD1   DD   DSN=DF03FILE,DISP=OLD
/*
/&