//DF05DATA JOB 'DF05DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF05DATA - RUN DF05DATA PROGRAM
//STEP1 EXEC PGM=DF05DATA
//DD1   DD   DSN=DF05FILE,DISP=SHR
/*
/&
