//DF05TEST JOB 'DF05TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF05TEST - RUN DF05TEST PROGRAM
//STEP1 EXEC PGM=DF05TEST
//DD1   DD   DSN=DF05FILE
//DD2   DD   DSN=DF05SORT
/*
/&