//DF06TEST JOB 'DF06TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF06TEST - RUN DF06TEST PROGRAM
//STEP1 EXEC PGM=DF06TEST
/*
/&
