//DF08TEST JOB 'DF08TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF08TEST - RUN DF08TEST PROGRAM
//STEP1 EXEC PGM=DF08TEST
/*
/&