//DF10TEST JOB 'DF10TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF10TEST - RUN DF10TEST PROGRAM
//STEP1 EXEC PGM=DF10TEST
/*
/&