//DF11TEST JOB 'DF11TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF11TEST - RUN DF11TEST PROGRAM
//STEP1 EXEC PGM=DF11TEST
/*
/&