//DF12TEST JOB 'DF12TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF12TEST - RUN DF12TEST PROGRAM
//STEP1 EXEC PGM=DF12TEST
/*
/&
