//DF13TEST JOB 'DF13TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF13TEST - RUN DF13TEST PROGRAM
//STEP1 EXEC PGM=DF13TEST
/*
/&
