//DF14TEST JOB 'DF14TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF14TEST - RUN DF14TEST PROGRAM
//STEP1 EXEC PGM=DF14TEST
/*
/&
