//DF16TEST JOB 'DF16TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF16TEST - RUN DF16TEST PROGRAM
//STEP1 EXEC PGM=DF16TEST
/*
/&