//DF17DATA JOB 'DF17DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF17DATA - RUN DF17DATA PROGRAM
//STEP1 EXEC PGM=DF17DATA
//DD1   DD   DSN=DF17FIL1,DISP=OLD
/*
/&