//DF17TEST JOB 'DF17TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF17TEST - RUN DF17TEST PROGRAM
//STEP1 EXEC PGM=DF17TEST
//DD1     DD DSN=DF17FIL1,DISP=SHR
//DD2     DD DSN=DF17FIL2,DISP=SHR
/*
/&