//DF18CALL JOB 'DF18CALL',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF18CALL - RUN DF18CALL PROGRAM
//* //STEP1 EXEC PGM=DF18CALL
/*
/&