//DF18TEST JOB 'DF18TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF18TEST - RUN DF18TEST PROGRAM
//STEP1 EXEC PGM=DF18TEST
/*
/&
