//DF21DATA JOB 'DF21DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF21DATA - RUN DF21DATA PROGRAM
//STEP1 EXEC PGM=DF21DATA
//DD1   DD   DSN=DF21FIL1,DISP=OLD
/*
/&
