//DF22TEST JOB 'DF22TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF22TEST - RUN DF22TEST PROGRAM
//STEP1 EXEC PGM=DF22TEST
//DD1   DD   DSN=DF22FILE
/*
/&
