//DF22DATA JOB 'DF22DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF22DATA - RUN DF22DATA PROGRAM
//STEP1 EXEC PGM=DF22DATA
//DD1   DD   DSN=DF22FILE,DISP=OUT
/*
/&
