//DF23TEST JOB 'DF23TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF23TEST - RUN DF23TEST PROGRAM
//STEP1 EXEC PGM=DF23TEST
/*
/&
