//DF24TEST JOB 'DF24TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF24TEST - RUN DF24TEST PROGRAM
//STEP1 EXEC PGM=DF24TEST
/*
/&