//DF25DATA JOB 'DF25DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF25DATA - RUN DF25DATA PROGRAM
//STEP1 EXEC PGM=DF25DATA
//DD1   DD   DSN=DF25FILE,DISP=OUT
/*
/&