//DF25TEST JOB 'DF25TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF25TEST - RUN DF25TEST PROGRAM
//STEP1 EXEC PGM=DF25TEST
//DD1   DD   DSN=DF25FILE
/*
/&