//DF26TEST JOB 'DF26TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF26TEST - RUN DF26TEST PROGRAM
//STEP1 EXEC PGM=DF26TEST
/*
/&
