//DF27TEST JOB 'DF27TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF27TEST - RUN DF27TEST PROGRAM
//STEP1 EXEC PGM=DF27TEST
/*
/&