//DF28TEST JOB 'DF28TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF28TEST - RUN DF28TEST PROGRAM
//STEP1 EXEC PGM=DF28TEST
/*
/&