//DF29TEST JOB 'DF29TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF29TEST - RUN DF29TEST PROGRAM
//STEP1 EXEC PGM=DF29TEST
//DD1   DD   DSN=DF29FILE,DISP=(OLD)
/*
/&