//DF30TEST JOB 'DF30TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF30TEST - RUN DF30TEST PROGRAM
//STEP1 EXEC PGM=DF30TEST
/*
/&