//DF31CALL JOB 'DF31CALL',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF31CALL - RUN DF31CALL PROGRAM
//* //STEP1 EXEC PGM=DF31CALL
/*
/