//DF34TEST JOB 'DF34TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF34TEST - RUN DF34TEST PROGRAM
//STEP1 EXEC PGM=DF34TEST
/*
/&