//DF35TEST JOB 'DF35TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF35TEST - RUN DF35TEST PROGRAM
//STEP1 EXEC PGM=DF35TEST
/*
/&