//DF36TEST JOB 'DF36TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF36TEST - RUN DF36TEST PROGRAM
//STEP1 EXEC PGM=DF36TEST
/*
/&
