//DF39TEST JOB 'DF39TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF39TEST - RUN DF39TEST PROGRAM
//STEP1 EXEC PGM=DF39TEST
/*
/&