//DF41TEST JOB 'DF41TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF41TEST - RUN DF41TEST PROGRAM
//STEP1 EXEC PGM=DF41TEST
/*
/&