//DF42TEST JOB 'DF42TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF42TEST - RUN DF42TEST PROGRAM
//STEP1 EXEC PGM=DF42TEST
/*
/&
