//DF46TEST JOB 'DF46TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF46TEST - RUN DF46TEST PROGRAM
//STEP1 EXEC PGM=DF46TEST
//DD1   DD   DSN=DF46FILE,DISP=SHR
/*
/&