//DF46DATA JOB 'DF46DATA',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF46DATA - RUN DF46DATA PROGRAM
//STEP1 EXEC PGM=DF46DATA
//DD1   DD   DSN=DF46FILE,DISP=OUT
/*
/&
