//DF47TEST JOB 'DF47TEST',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*  DF47TEST - RUN DF47TEST PROGRAM
//STEP1 EXEC PGM=DF47TEST
/*
/&